<a href="https://colab.research.google.com/github/thien1892/Skill_for_Data_Scientist_with_Python/blob/main/Data_Manipulation_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
cd /content/drive/MyDrive/Data_scientist_with_python/Dataset/Data Manipulation with pandas/

/content/drive/MyDrive/Data_scientist_with_python/Dataset/Data Manipulation with pandas

#1. Exploring a DataFrame

In [78]:
import pandas as pd
import numpy as np
df = pd.read_csv('homelessness.csv', index_col= 0)

In [14]:
df.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   region          51 non-null     object
 1   state           51 non-null     object
 2   individuals     51 non-null     float64
 3   family_members  51 non-null     float64
 4   state_pop       51 non-null     int64
dtypes: float64(2), int64(1), object(2)
memory usage: 2.4+ KB

In [16]:
df.shape

(51, 5)

In [17]:
df.describe()

         individuals  family_members     state_pop
count      51.000000       51.000000  5.100000e+01
mean     7225.784314     3504.882353  6.405637e+06
std     15991.025083     7805.411811  7.327258e+06
min       434.000000       75.000000  5.776010e+05
25%      1446.500000      592.000000  1.777414e+06
50%      3082.000000     1482.000000  4.461153e+06
75%      6781.500000     3196.000000  7.340946e+06
max    109008.000000    52070.000000  3.946159e+07

In [18]:
df.head().values

array([['East South Central', 'Alabama', 2570.0, 864.0, 4887681],
       ['Pacific', 'Alaska', 1434.0, 582.0, 735139],
       ['Mountain', 'Arizona', 7259.0, 2606.0, 7158024],
       ['West South Central', 'Arkansas', 2280.0, 432.0, 3009733],
       ['Pacific', 'California', 109008.0, 20964.0, 39461588]],
      dtype=object)

In [19]:
df.columns

Index(['region', 'state', 'individuals', 'family_members', 'state_pop'], dtype='object')

In [20]:
df.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
            34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
            50],
           dtype='int64')

# 2. Sorting

In [22]:
df.sort_values("region").head()

                region      state  individuals  family_members  state_pop
35  East North Central       Ohio       6929.0          3320.0   11676341
49  East North Central  Wisconsin       2740.0          2167.0    5807406
22  East North Central   Michigan       5209.0          3142.0    9984072
13  East North Central   Illinois       6752.0          3891.0   12723071
14  East North Central    Indiana       3776.0          1482.0    6695497

In [23]:
df.sort_values("region", ascending= False).head()

                region      state  individuals  family_members  state_pop
36  West South Central   Oklahoma       2823.0          1048.0    3940235
3   West South Central   Arkansas       2280.0           432.0    3009733
18  West South Central  Louisiana       2540.0           519.0    4659690
43  West South Central      Texas      19199.0          6111.0   28628666
25  West North Central   Missouri       3776.0          2107.0    6121623

In [24]:
df.sort_values(['region', 'state']).head()

                region      state  individuals  family_members  state_pop
13  East North Central   Illinois       6752.0          3891.0   12723071
14  East North Central    Indiana       3776.0          1482.0    6695497
22  East North Central   Michigan       5209.0          3142.0    9984072
35  East North Central       Ohio       6929.0          3320.0   11676341
49  East North Central  Wisconsin       2740.0          2167.0    5807406

In [25]:
df.sort_values(['region', 'state'], ascending= [True, False]).head()

                region      state  individuals  family_members  state_pop
49  East North Central  Wisconsin       2740.0          2167.0    5807406
35  East North Central       Ohio       6929.0          3320.0   11676341
22  East North Central   Michigan       5209.0          3142.0    9984072
14  East North Central    Indiana       3776.0          1482.0    6695497
13  East North Central   Illinois       6752.0          3891.0   12723071

# 3.Subsetting

In [26]:
df['region'].head()

0    East South Central
1               Pacific
2              Mountain
3    West South Central
4               Pacific
Name: region, dtype: object

In [27]:
df[['region', 'state']].head()

               region       state
0  East South Central     Alabama
1             Pacific      Alaska
2            Mountain     Arizona
3  West South Central    Arkansas
4             Pacific  California

In [29]:
df['individuals'].head() > 3000

0    False
1    False
2     True
3    False
4     True
Name: individuals, dtype: bool

In [30]:
df[df['individuals'] > 3000].head()

           region                 state  individuals  family_members  state_pop
2        Mountain               Arizona       7259.0          2606.0    7158024
4         Pacific            California     109008.0         20964.0   39461588
5        Mountain              Colorado       7607.0          3250.0    5691287
8  South Atlantic  District of Columbia       3770.0          3134.0     701547
9  South Atlantic               Florida      21443.0          9587.0   21244317

In [32]:
df[df['region'] == 'South Atlantic']

            region                 state  ...  family_members  state_pop
7   South Atlantic              Delaware  ...           374.0     965479
8   South Atlantic  District of Columbia  ...          3134.0     701547
9   South Atlantic               Florida  ...          9587.0   21244317
10  South Atlantic               Georgia  ...          2556.0   10511131
20  South Atlantic              Maryland  ...          2230.0    6035802
33  South Atlantic        North Carolina  ...          2817.0   10381615
40  South Atlantic        South Carolina  ...           851.0    5084156
46  South Atlantic              Virginia  ...          2047.0    8501286
48  South Atlantic         West Virginia  ...           222.0    1804291

[9 rows x 5 columns]

In [34]:
df[(df['region'] == 'South Atlantic') & (df['individuals'] > 4000)]

            region           state  individuals  family_members  state_pop
9   South Atlantic         Florida      21443.0          9587.0   21244317
10  South Atlantic         Georgia       6943.0          2556.0   10511131
20  South Atlantic        Maryland       4914.0          2230.0    6035802
33  South Atlantic  North Carolina       6451.0          2817.0   10381615

In [35]:
df[df['state'].isin(['Florida', 'North Carolina'])]

            region           state  individuals  family_members  state_pop
9   South Atlantic         Florida      21443.0          9587.0   21244317
33  South Atlantic  North Carolina       6451.0          2817.0   10381615

In [36]:
df['state_pop_1000'] = df['state_pop'] / 1000
df.head()

               region       state  ...  state_pop  state_pop_1000
0  East South Central     Alabama  ...    4887681        4887.681
1             Pacific      Alaska  ...     735139         735.139
2            Mountain     Arizona  ...    7158024        7158.024
3  West South Central    Arkansas  ...    3009733        3009.733
4             Pacific  California  ...   39461588       39461.588

[5 rows x 6 columns]

# 4. Summary statistics

In [37]:
# .median() , .mode(), .min() , .max(), .var() , .std(), .sum(), .quantile()
df['state_pop'].max()

39461588

In [41]:
def pct75(column):
  return column.quantile(0.75)

In [42]:
df['family_members'].agg(pct75)

3196.0

In [47]:
df[['individuals', 'family_members']].agg([pct75, max, min])

       individuals  family_members
pct75       6781.5          3196.0
max       109008.0         52070.0
min          434.0            75.0

In [49]:
df['individuals'].head()

0      2570.0
1      1434.0
2      7259.0
3      2280.0
4    109008.0
Name: individuals, dtype: float64

In [51]:
df['individuals'].head().cumsum()

0      2570.0
1      4004.0
2     11263.0
3     13543.0
4    122551.0
Name: individuals, dtype: float64

In [56]:
df['individuals'].head().cummax()

0      2570.0
1      2570.0
2      7259.0
3      7259.0
4    109008.0
Name: individuals, dtype: float64

# 5.Counting

In [60]:
df.drop_duplicates(subset= ['region'])

                region        state  ...  state_pop  state_pop_1000
0   East South Central      Alabama  ...    4887681        4887.681
1              Pacific       Alaska  ...     735139         735.139
2             Mountain      Arizona  ...    7158024        7158.024
3   West South Central     Arkansas  ...    3009733        3009.733
6          New England  Connecticut  ...    3571520        3571.520
7       South Atlantic     Delaware  ...     965479         965.479
13  East North Central     Illinois  ...   12723071       12723.071
15  West North Central         Iowa  ...    3148618        3148.618
30        Mid-Atlantic   New Jersey  ...    8886025        8886.025

[9 rows x 6 columns]

In [61]:
df.drop_duplicates(subset= ['state', 'region']).head()

               region       state  ...  state_pop  state_pop_1000
0  East South Central     Alabama  ...    4887681        4887.681
1             Pacific      Alaska  ...     735139         735.139
2            Mountain     Arizona  ...    7158024        7158.024
3  West South Central    Arkansas  ...    3009733        3009.733
4             Pacific  California  ...   39461588       39461.588

[5 rows x 6 columns]

In [62]:
df['region'].value_counts()

South Atlantic        9
Mountain              8
West North Central    7
New England           6
Pacific               5
East North Central    5
West South Central    4
East South Central    4
Mid-Atlantic          3
Name: region, dtype: int64

In [72]:
df['region'].value_counts(ascending = True, normalize= True)

Mid-Atlantic          0.058824
East South Central    0.078431
West South Central    0.078431
East North Central    0.098039
Pacific               0.098039
New England           0.117647
West North Central    0.137255
Mountain              0.156863
South Atlantic        0.176471
Name: region, dtype: float64

In [73]:
# 6. Grouped summary statistics

In [74]:
df.groupby('region')['individuals'].mean()

region
East North Central     5081.200000
East South Central     3117.000000
Mid-Atlantic          18012.666667
Mountain               3561.375000
New England            2150.500000
Pacific               28427.200000
South Atlantic         5806.666667
West North Central     1995.857143
West South Central     6710.500000
Name: individuals, dtype: float64

In [80]:
df.groupby('region')['individuals'].agg([min, max, np.mean, sum])

                       min       max          mean       sum
region
East North Central  2740.0    6929.0   5081.200000   25406.0
East South Central  1024.0    6139.0   3117.000000   12468.0
Mid-Atlantic        6048.0   39827.0  18012.666667   54038.0
Mountain             434.0    7607.0   3561.375000   28491.0
New England          747.0    6811.0   2150.500000   12903.0
Pacific             1434.0  109008.0  28427.200000  142136.0
South Atlantic       708.0   21443.0   5806.666667   52260.0
West North Central   467.0    3993.0   1995.857143   13971.0
West South Central  2280.0   19199.0   6710.500000   26842.0

In [83]:
df.groupby(['region', 'state'])['individuals'].mean().head(10)

region              state
East North Central  Illinois       6752.0
                    Indiana        3776.0
                    Michigan       5209.0
                    Ohio           6929.0
                    Wisconsin      2740.0
East South Central  Alabama        2570.0
                    Kentucky       2735.0
                    Mississippi    1024.0
                    Tennessee      6139.0
Mid-Atlantic        New Jersey     6048.0
Name: individuals, dtype: float64

In [87]:
df.groupby(['region', 'state'])['individuals', 'family_members'].agg([max, min, np.mean]).head(10)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                               individuals          ... family_members
                                       max     min  ...            min    mean
region             state                            ...
East North Central Illinois         6752.0  6752.0  ...         3891.0  3891.0
                   Indiana          3776.0  3776.0  ...         1482.0  1482.0
                   Michigan         5209.0  5209.0  ...         3142.0  3142.0
                   Ohio             6929.0  6929.0  ...         3320.0  3320.0
                   Wisconsin        2740.0  2740.0  ...         2167.0  2167.0
East South Central Alabama          2570.0  2570.0  ...          864.0   864.0
                   Kentucky         2735.0  2735.0  ...          953.0   953.0
                   Mississippi      1024.0  1024.0  ...          328.0   328.0
                   Tennessee        6139.0  6139.0  ...         1744.0  1744.0
Mid-Atlantic       New Jersey       6048.0  6048.0  ...         3350.0  3350.0

[10 rows x 6 columns]